espressif/esp-idf/components/soc/esp32c61/register/soc/ledc_reg.h
#define LEDC_CH2_GAMMA_RANGE1_REG  (DR_REG_LEDC_BASE + 0x484)
/* LEDC_CH2_GAMMA_RANGE1_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE1_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE1_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE1_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE1_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE1_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE1_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE1_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE1_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE1_SCALE_M  ((LEDC_CH2_GAMMA_RANGE1_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE1_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE1_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE1_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE1_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE1_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE1_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE1_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE1_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE1_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE1_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE1_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE1_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE1_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE1_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE1_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE2_REG  (DR_REG_LEDC_BASE + 0x488)
/* LEDC_CH2_GAMMA_RANGE2_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE2_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE2_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE2_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE2_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE2_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE2_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE2_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE2_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE2_SCALE_M  ((LEDC_CH2_GAMMA_RANGE2_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE2_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE2_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE2_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE2_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE2_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE2_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE2_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE2_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE2_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE2_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE2_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE2_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE2_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE2_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE2_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE3_REG  (DR_REG_LEDC_BASE + 0x48c)
/* LEDC_CH2_GAMMA_RANGE3_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE3_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE3_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE3_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE3_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE3_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE3_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE3_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE3_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE3_SCALE_M  ((LEDC_CH2_GAMMA_RANGE3_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE3_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE3_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE3_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE3_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE3_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE3_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE3_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE3_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE3_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE3_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE3_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE3_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE3_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE3_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE3_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE4_REG  (DR_REG_LEDC_BASE + 0x490)
/* LEDC_CH2_GAMMA_RANGE4_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE4_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE4_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE4_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE4_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE4_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE4_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE4_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE4_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE4_SCALE_M  ((LEDC_CH2_GAMMA_RANGE4_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE4_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE4_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE4_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE4_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE4_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE4_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE4_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE4_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE4_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE4_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE4_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE4_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE4_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE4_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE4_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE5_REG  (DR_REG_LEDC_BASE + 0x494)
/* LEDC_CH2_GAMMA_RANGE5_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE5_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE5_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE5_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE5_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE5_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE5_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE5_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE5_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE5_SCALE_M  ((LEDC_CH2_GAMMA_RANGE5_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE5_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE5_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE5_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE5_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE5_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE5_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE5_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE5_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE5_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE5_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE5_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE5_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE5_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE5_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE5_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE6_REG  (DR_REG_LEDC_BASE + 0x498)
/* LEDC_CH2_GAMMA_RANGE6_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE6_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE6_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE6_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE6_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE6_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE6_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE6_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE6_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE6_SCALE_M  ((LEDC_CH2_GAMMA_RANGE6_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE6_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE6_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE6_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE6_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE6_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE6_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE6_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE6_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE6_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE6_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE6_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE6_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE6_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE6_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE6_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE7_REG  (DR_REG_LEDC_BASE + 0x49c)
/* LEDC_CH2_GAMMA_RANGE7_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE7_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE7_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE7_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE7_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE7_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE7_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE7_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE7_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE7_SCALE_M  ((LEDC_CH2_GAMMA_RANGE7_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE7_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE7_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE7_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE7_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE7_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE7_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE7_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE7_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE7_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE7_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE7_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE7_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE7_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE7_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE7_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE8_REG  (DR_REG_LEDC_BASE + 0x4a0)
/* LEDC_CH2_GAMMA_RANGE8_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE8_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE8_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE8_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE8_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE8_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE8_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE8_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE8_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE8_SCALE_M  ((LEDC_CH2_GAMMA_RANGE8_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE8_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE8_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE8_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE8_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE8_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE8_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE8_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE8_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE8_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE8_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE8_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE8_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE8_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE8_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE8_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE9_REG  (DR_REG_LEDC_BASE + 0x4a4)
/* LEDC_CH2_GAMMA_RANGE9_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE9_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE9_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE9_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE9_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE9_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE9_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE9_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE9_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE9_SCALE_M  ((LEDC_CH2_GAMMA_RANGE9_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE9_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE9_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE9_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE9_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE9_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE9_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE9_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE9_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE9_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE9_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE9_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE9_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE9_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE9_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE9_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE10_REG  (DR_REG_LEDC_BASE + 0x4a8)
/* LEDC_CH2_GAMMA_RANGE10_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE10_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE10_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE10_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE10_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE10_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE10_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE10_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE10_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE10_SCALE_M  ((LEDC_CH2_GAMMA_RANGE10_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE10_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE10_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE10_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE10_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE10_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE10_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE10_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE10_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE10_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE10_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE10_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE10_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE10_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE10_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE10_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE11_REG  (DR_REG_LEDC_BASE + 0x4ac)
/* LEDC_CH2_GAMMA_RANGE11_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE11_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE11_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE11_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE11_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE11_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE11_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE11_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE11_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE11_SCALE_M  ((LEDC_CH2_GAMMA_RANGE11_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE11_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE11_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE11_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE11_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE11_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE11_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE11_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE11_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE11_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE11_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE11_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE11_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE11_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE11_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE11_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE12_REG  (DR_REG_LEDC_BASE + 0x4b0)
/* LEDC_CH2_GAMMA_RANGE12_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE12_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE12_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE12_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE12_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE12_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE12_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE12_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE12_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE12_SCALE_M  ((LEDC_CH2_GAMMA_RANGE12_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE12_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE12_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE12_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE12_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE12_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE12_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE12_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE12_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE12_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE12_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE12_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE12_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE12_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE12_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE12_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE13_REG  (DR_REG_LEDC_BASE + 0x4b4)
/* LEDC_CH2_GAMMA_RANGE13_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE13_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE13_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE13_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE13_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE13_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE13_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE13_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE13_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE13_SCALE_M  ((LEDC_CH2_GAMMA_RANGE13_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE13_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE13_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE13_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE13_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE13_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE13_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE13_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE13_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE13_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE13_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE13_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE13_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE13_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE13_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE13_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE14_REG  (DR_REG_LEDC_BASE + 0x4b8)
/* LEDC_CH2_GAMMA_RANGE14_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE14_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE14_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE14_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE14_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE14_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE14_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE14_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE14_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE14_SCALE_M  ((LEDC_CH2_GAMMA_RANGE14_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE14_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE14_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE14_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE14_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE14_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE14_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE14_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE14_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE14_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE14_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE14_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE14_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE14_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE14_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE14_DUTY_INC_S  0

#define LEDC_CH2_GAMMA_RANGE15_REG  (DR_REG_LEDC_BASE + 0x4bc)
/* LEDC_CH2_GAMMA_RANGE15_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE15_DUTY_NUM    0x000003FF
#define LEDC_CH2_GAMMA_RANGE15_DUTY_NUM_M  ((LEDC_CH2_GAMMA_RANGE15_DUTY_NUM_V)<<(LEDC_CH2_GAMMA_RANGE15_DUTY_NUM_S))
#define LEDC_CH2_GAMMA_RANGE15_DUTY_NUM_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE15_DUTY_NUM_S  21
/* LEDC_CH2_GAMMA_RANGE15_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE15_SCALE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE15_SCALE_M  ((LEDC_CH2_GAMMA_RANGE15_SCALE_V)<<(LEDC_CH2_GAMMA_RANGE15_SCALE_S))
#define LEDC_CH2_GAMMA_RANGE15_SCALE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE15_SCALE_S  11
/* LEDC_CH2_GAMMA_RANGE15_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_GAMMA_RANGE15_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_GAMMA_RANGE15_DUTY_CYCLE_M  ((LEDC_CH2_GAMMA_RANGE15_DUTY_CYCLE_V)<<(LEDC_CH2_GAMMA_RANGE15_DUTY_CYCLE_S))
#define LEDC_CH2_GAMMA_RANGE15_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_GAMMA_RANGE15_DUTY_CYCLE_S  1
/* LEDC_CH2_GAMMA_RANGE15_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_GAMMA_RANGE15_DUTY_INC    (BIT(0))
#define LEDC_CH2_GAMMA_RANGE15_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_GAMMA_RANGE15_DUTY_INC_V  0x1
#define LEDC_CH2_GAMMA_RANGE15_DUTY_INC_S  0


#define LEDC_CH3_GAMMA_RANGE0_REG  (DR_REG_LEDC_BASE + 0x4c0)
/* LEDC_CH3_GAMMA_RANGE0_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE0_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE0_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE0_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE0_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE0_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE0_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE0_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE0_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE0_SCALE_M  ((LEDC_CH3_GAMMA_RANGE0_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE0_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE0_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE0_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE0_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE0_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE0_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE0_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE0_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE0_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE0_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE0_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE0_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE0_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE0_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE0_DUTY_INC_S  0

#define LEDC_CH3_GAMMA_RANGE1_REG  (DR_REG_LEDC_BASE + 0x4c4)
/* LEDC_CH3_GAMMA_RANGE1_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE1_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE1_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE1_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE1_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE1_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE1_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE1_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE1_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE1_SCALE_M  ((LEDC_CH3_GAMMA_RANGE1_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE1_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE1_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE1_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE1_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE1_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE1_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE1_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE1_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE1_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE1_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE1_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE1_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE1_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE1_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE1_DUTY_INC_S  0

