espressif/esp-idf/components/soc/esp32c61/register/soc/ledc_reg.h
#define LEDC_CH4_GAMMA_RANGE6_REG  (DR_REG_LEDC_BASE + 0x518)
/* LEDC_CH4_GAMMA_RANGE6_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE6_DUTY_NUM    0x000003FF
#define LEDC_CH4_GAMMA_RANGE6_DUTY_NUM_M  ((LEDC_CH4_GAMMA_RANGE6_DUTY_NUM_V)<<(LEDC_CH4_GAMMA_RANGE6_DUTY_NUM_S))
#define LEDC_CH4_GAMMA_RANGE6_DUTY_NUM_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE6_DUTY_NUM_S  21
/* LEDC_CH4_GAMMA_RANGE6_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE6_SCALE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE6_SCALE_M  ((LEDC_CH4_GAMMA_RANGE6_SCALE_V)<<(LEDC_CH4_GAMMA_RANGE6_SCALE_S))
#define LEDC_CH4_GAMMA_RANGE6_SCALE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE6_SCALE_S  11
/* LEDC_CH4_GAMMA_RANGE6_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE6_DUTY_CYCLE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE6_DUTY_CYCLE_M  ((LEDC_CH4_GAMMA_RANGE6_DUTY_CYCLE_V)<<(LEDC_CH4_GAMMA_RANGE6_DUTY_CYCLE_S))
#define LEDC_CH4_GAMMA_RANGE6_DUTY_CYCLE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE6_DUTY_CYCLE_S  1
/* LEDC_CH4_GAMMA_RANGE6_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH4_GAMMA_RANGE6_DUTY_INC    (BIT(0))
#define LEDC_CH4_GAMMA_RANGE6_DUTY_INC_M  (BIT(0))
#define LEDC_CH4_GAMMA_RANGE6_DUTY_INC_V  0x1
#define LEDC_CH4_GAMMA_RANGE6_DUTY_INC_S  0

#define LEDC_CH4_GAMMA_RANGE7_REG  (DR_REG_LEDC_BASE + 0x51c)
/* LEDC_CH4_GAMMA_RANGE7_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE7_DUTY_NUM    0x000003FF
#define LEDC_CH4_GAMMA_RANGE7_DUTY_NUM_M  ((LEDC_CH4_GAMMA_RANGE7_DUTY_NUM_V)<<(LEDC_CH4_GAMMA_RANGE7_DUTY_NUM_S))
#define LEDC_CH4_GAMMA_RANGE7_DUTY_NUM_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE7_DUTY_NUM_S  21
/* LEDC_CH4_GAMMA_RANGE7_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE7_SCALE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE7_SCALE_M  ((LEDC_CH4_GAMMA_RANGE7_SCALE_V)<<(LEDC_CH4_GAMMA_RANGE7_SCALE_S))
#define LEDC_CH4_GAMMA_RANGE7_SCALE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE7_SCALE_S  11
/* LEDC_CH4_GAMMA_RANGE7_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE7_DUTY_CYCLE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE7_DUTY_CYCLE_M  ((LEDC_CH4_GAMMA_RANGE7_DUTY_CYCLE_V)<<(LEDC_CH4_GAMMA_RANGE7_DUTY_CYCLE_S))
#define LEDC_CH4_GAMMA_RANGE7_DUTY_CYCLE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE7_DUTY_CYCLE_S  1
/* LEDC_CH4_GAMMA_RANGE7_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH4_GAMMA_RANGE7_DUTY_INC    (BIT(0))
#define LEDC_CH4_GAMMA_RANGE7_DUTY_INC_M  (BIT(0))
#define LEDC_CH4_GAMMA_RANGE7_DUTY_INC_V  0x1
#define LEDC_CH4_GAMMA_RANGE7_DUTY_INC_S  0

#define LEDC_CH4_GAMMA_RANGE8_REG  (DR_REG_LEDC_BASE + 0x520)
/* LEDC_CH4_GAMMA_RANGE8_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE8_DUTY_NUM    0x000003FF
#define LEDC_CH4_GAMMA_RANGE8_DUTY_NUM_M  ((LEDC_CH4_GAMMA_RANGE8_DUTY_NUM_V)<<(LEDC_CH4_GAMMA_RANGE8_DUTY_NUM_S))
#define LEDC_CH4_GAMMA_RANGE8_DUTY_NUM_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE8_DUTY_NUM_S  21
/* LEDC_CH4_GAMMA_RANGE8_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE8_SCALE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE8_SCALE_M  ((LEDC_CH4_GAMMA_RANGE8_SCALE_V)<<(LEDC_CH4_GAMMA_RANGE8_SCALE_S))
#define LEDC_CH4_GAMMA_RANGE8_SCALE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE8_SCALE_S  11
/* LEDC_CH4_GAMMA_RANGE8_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE8_DUTY_CYCLE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE8_DUTY_CYCLE_M  ((LEDC_CH4_GAMMA_RANGE8_DUTY_CYCLE_V)<<(LEDC_CH4_GAMMA_RANGE8_DUTY_CYCLE_S))
#define LEDC_CH4_GAMMA_RANGE8_DUTY_CYCLE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE8_DUTY_CYCLE_S  1
/* LEDC_CH4_GAMMA_RANGE8_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH4_GAMMA_RANGE8_DUTY_INC    (BIT(0))
#define LEDC_CH4_GAMMA_RANGE8_DUTY_INC_M  (BIT(0))
#define LEDC_CH4_GAMMA_RANGE8_DUTY_INC_V  0x1
#define LEDC_CH4_GAMMA_RANGE8_DUTY_INC_S  0

#define LEDC_CH4_GAMMA_RANGE9_REG  (DR_REG_LEDC_BASE + 0x524)
/* LEDC_CH4_GAMMA_RANGE9_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE9_DUTY_NUM    0x000003FF
#define LEDC_CH4_GAMMA_RANGE9_DUTY_NUM_M  ((LEDC_CH4_GAMMA_RANGE9_DUTY_NUM_V)<<(LEDC_CH4_GAMMA_RANGE9_DUTY_NUM_S))
#define LEDC_CH4_GAMMA_RANGE9_DUTY_NUM_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE9_DUTY_NUM_S  21
/* LEDC_CH4_GAMMA_RANGE9_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE9_SCALE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE9_SCALE_M  ((LEDC_CH4_GAMMA_RANGE9_SCALE_V)<<(LEDC_CH4_GAMMA_RANGE9_SCALE_S))
#define LEDC_CH4_GAMMA_RANGE9_SCALE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE9_SCALE_S  11
/* LEDC_CH4_GAMMA_RANGE9_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE9_DUTY_CYCLE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE9_DUTY_CYCLE_M  ((LEDC_CH4_GAMMA_RANGE9_DUTY_CYCLE_V)<<(LEDC_CH4_GAMMA_RANGE9_DUTY_CYCLE_S))
#define LEDC_CH4_GAMMA_RANGE9_DUTY_CYCLE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE9_DUTY_CYCLE_S  1
/* LEDC_CH4_GAMMA_RANGE9_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH4_GAMMA_RANGE9_DUTY_INC    (BIT(0))
#define LEDC_CH4_GAMMA_RANGE9_DUTY_INC_M  (BIT(0))
#define LEDC_CH4_GAMMA_RANGE9_DUTY_INC_V  0x1
#define LEDC_CH4_GAMMA_RANGE9_DUTY_INC_S  0

#define LEDC_CH4_GAMMA_RANGE10_REG  (DR_REG_LEDC_BASE + 0x528)
/* LEDC_CH4_GAMMA_RANGE10_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE10_DUTY_NUM    0x000003FF
#define LEDC_CH4_GAMMA_RANGE10_DUTY_NUM_M  ((LEDC_CH4_GAMMA_RANGE10_DUTY_NUM_V)<<(LEDC_CH4_GAMMA_RANGE10_DUTY_NUM_S))
#define LEDC_CH4_GAMMA_RANGE10_DUTY_NUM_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE10_DUTY_NUM_S  21
/* LEDC_CH4_GAMMA_RANGE10_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE10_SCALE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE10_SCALE_M  ((LEDC_CH4_GAMMA_RANGE10_SCALE_V)<<(LEDC_CH4_GAMMA_RANGE10_SCALE_S))
#define LEDC_CH4_GAMMA_RANGE10_SCALE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE10_SCALE_S  11
/* LEDC_CH4_GAMMA_RANGE10_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE10_DUTY_CYCLE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE10_DUTY_CYCLE_M  ((LEDC_CH4_GAMMA_RANGE10_DUTY_CYCLE_V)<<(LEDC_CH4_GAMMA_RANGE10_DUTY_CYCLE_S))
#define LEDC_CH4_GAMMA_RANGE10_DUTY_CYCLE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE10_DUTY_CYCLE_S  1
/* LEDC_CH4_GAMMA_RANGE10_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH4_GAMMA_RANGE10_DUTY_INC    (BIT(0))
#define LEDC_CH4_GAMMA_RANGE10_DUTY_INC_M  (BIT(0))
#define LEDC_CH4_GAMMA_RANGE10_DUTY_INC_V  0x1
#define LEDC_CH4_GAMMA_RANGE10_DUTY_INC_S  0

#define LEDC_CH4_GAMMA_RANGE11_REG  (DR_REG_LEDC_BASE + 0x52c)
/* LEDC_CH4_GAMMA_RANGE11_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE11_DUTY_NUM    0x000003FF
#define LEDC_CH4_GAMMA_RANGE11_DUTY_NUM_M  ((LEDC_CH4_GAMMA_RANGE11_DUTY_NUM_V)<<(LEDC_CH4_GAMMA_RANGE11_DUTY_NUM_S))
#define LEDC_CH4_GAMMA_RANGE11_DUTY_NUM_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE11_DUTY_NUM_S  21
/* LEDC_CH4_GAMMA_RANGE11_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE11_SCALE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE11_SCALE_M  ((LEDC_CH4_GAMMA_RANGE11_SCALE_V)<<(LEDC_CH4_GAMMA_RANGE11_SCALE_S))
#define LEDC_CH4_GAMMA_RANGE11_SCALE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE11_SCALE_S  11
/* LEDC_CH4_GAMMA_RANGE11_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH4_GAMMA_RANGE11_DUTY_CYCLE    0x000003FF
#define LEDC_CH4_GAMMA_RANGE11_DUTY_CYCLE_M  ((LEDC_CH4_GAMMA_RANGE11_DUTY_CYCLE_V)<<(LEDC_CH4_GAMMA_RANGE11_DUTY_CYCLE_S))
#define LEDC_CH4_GAMMA_RANGE11_DUTY_CYCLE_V  0x3FF
#define LEDC_CH4_GAMMA_RANGE11_DUTY_CYCLE_S  1
/* LEDC_CH4_GAMMA_RANGE11_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH4_GAMMA_RANGE11_DUTY_INC    (BIT(0))
#define LEDC_CH4_GAMMA_RANGE11_DUTY_INC_M  (BIT(0))
#define LEDC_CH4_GAMMA_RANGE11_DUTY_INC_V  0x1
#define LEDC_CH4_GAMMA_RANGE11_DUTY_INC_S  0

